gianluca996/LPC55S69/USB_Log_Insert/sources/host_msd_fatfs.c
#if _USE_FORWARD && _FS_TINY
static uint32_t USB_HostMsdFatfsForward(const uint8_t *data, uint32_t dataLength)
{
    uint32_t resultCount = dataLength;

    if (dataLength == 0)
    {
        return 1;
    }
    else
    {
        do
        {
            usb_echo("%c", *data);
            data++;
            resultCount--;
        } while (resultCount);
        return dataLength;
    }
}
#endif

static void USB_HostMsdFatfsTest(usb_host_msd_fatfs_instance_t *msdFatfsInstance, uint8_t Dati[])
{
    FRESULT fatfsCode;
//  FATFS *fs;
    FIL file;
//  FILINFO fileInfo;
    uint32_t freeClusterNumber;
    uint32_t index;
    uint32_t resultSize;
//  char *testString;
    uint8_t driverNumberBuffer[3];
    uint32_t i = 0;
    uint32_t x = 0;

	#define BUFFER_SIZE_TEST 200
    uint8_t  demoRingBuffer_test[BUFFER_SIZE_TEST];


    for (index = 0; index < BUFFER_SIZE_TEST; index++)
    {
    	demoRingBuffer_test[index] = Dati[index];

    }


#if _USE_LFN
    static uint8_t fileNameBuffer[_MAX_LFN];
    fileInfo.lfname = fileNameBuffer;
    fileInfo.lfsize = _MAX_LFN;
#endif /* _USE_LFN */

    /* time delay */
    for (freeClusterNumber = 0; freeClusterNumber < 10000; ++freeClusterNumber)
    {
        __ASM("nop");
    }

    usb_echo("............................fatfs test.....................\r\n");

    usb_echo("fatfs mount as logiacal driver %d......", USBDISK);
    sprintf((char *)&driverNumberBuffer[0], "%c:", USBDISK + '0');
    fatfsCode = f_mount(&fatfs, (char const *)&driverNumberBuffer[0], 0);
    if (fatfsCode)
    {
        usb_echo("error\r\n");
        USB_HostMsdFatfsTestDone();
        return;
    }
    usb_echo("success\r\n");

#if (_FS_RPATH >= 2)
    fatfsCode = f_chdrive((char const *)&driverNumberBuffer[0]);
    if (fatfsCode)
    {
        usb_echo("error\r\n");
        USB_HostMsdFatfsTestDone();
        return;
    }
#endif

    /*-------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    usb_echo("file operation:\r\n");
    usb_echo("create file \"LOG_USB.TXT\"......");
    fatfsCode = f_open(&file, _T("1:/LOG_USB.TXT"), FA_WRITE | FA_READ | FA_OPEN_APPEND);
    if (fatfsCode)
    {
        if (fatfsCode == FR_EXIST)
        {
            usb_echo("file exist\r\n");
        }
        else
        {
            usb_echo("error\r\n");
            USB_HostMsdFatfsTestDone();
            return;
        }
    }
    else
    {
        usb_echo("success\r\n");
    }


    /*-------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    usb_echo("test f_write......");
    /*
    for (index = 0; index < 300; ++index)
    {
        testBuffer[index] = 'A';
    }
    testBuffer[301] = '\r';
    testBuffer[302] = '\n';
	*/

    /*
    for (index = 0; index < BUFFER_SIZE_TEST; index++)
    {
    	testBuffer[index] = Dati[index];
    }

    testBuffer[200] = '\r';
    testBuffer[201] = '\n';
    */

    /*-------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    char test[400];


	sprintf (test, "%02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d %02d",
					demoRingBuffer_test[38],demoRingBuffer_test[39],demoRingBuffer_test[40],demoRingBuffer_test[41],demoRingBuffer_test[42],
					demoRingBuffer_test[43],demoRingBuffer_test[44],demoRingBuffer_test[45],demoRingBuffer_test[46],demoRingBuffer_test[47],
					demoRingBuffer_test[48],demoRingBuffer_test[49],demoRingBuffer_test[50],demoRingBuffer_test[51],demoRingBuffer_test[52],
					demoRingBuffer_test[53],demoRingBuffer_test[54],demoRingBuffer_test[55],demoRingBuffer_test[56],demoRingBuffer_test[57],
					demoRingBuffer_test[58],demoRingBuffer_test[59],demoRingBuffer_test[60],demoRingBuffer_test[61],demoRingBuffer_test[62],
					demoRingBuffer_test[63],demoRingBuffer_test[64],demoRingBuffer_test[65],demoRingBuffer_test[66],demoRingBuffer_test[67],
					demoRingBuffer_test[68],demoRingBuffer_test[69],demoRingBuffer_test[70],demoRingBuffer_test[71],demoRingBuffer_test[72],
					demoRingBuffer_test[73],demoRingBuffer_test[74],demoRingBuffer_test[75],demoRingBuffer_test[76],demoRingBuffer_test[77],
					demoRingBuffer_test[78],demoRingBuffer_test[79],demoRingBuffer_test[80],demoRingBuffer_test[81],demoRingBuffer_test[82],
					demoRingBuffer_test[83],demoRingBuffer_test[84],demoRingBuffer_test[85],demoRingBuffer_test[86],demoRingBuffer_test[87],
					demoRingBuffer_test[88],demoRingBuffer_test[89],demoRingBuffer_test[90],demoRingBuffer_test[91],demoRingBuffer_test[92],
					demoRingBuffer_test[93],demoRingBuffer_test[94],demoRingBuffer_test[95],demoRingBuffer_test[96],demoRingBuffer_test[97],
					demoRingBuffer_test[98],demoRingBuffer_test[99],demoRingBuffer_test[100],demoRingBuffer_test[101],demoRingBuffer_test[102],
					demoRingBuffer_test[103],demoRingBuffer_test[104],demoRingBuffer_test[105],demoRingBuffer_test[106],demoRingBuffer_test[107],
					demoRingBuffer_test[108],demoRingBuffer_test[109],demoRingBuffer_test[110],demoRingBuffer_test[111],demoRingBuffer_test[112],
					demoRingBuffer_test[113],demoRingBuffer_test[114],demoRingBuffer_test[115],demoRingBuffer_test[116],demoRingBuffer_test[117],
					demoRingBuffer_test[118],demoRingBuffer_test[119]
			);



	testBuffer[0] = 35; // #
	testBuffer[1] = 51; // 3
	testBuffer[2] = 53; // 5
	testBuffer[3] = 35; // #
	testBuffer[4] = 0;  // Spazio

	char Number[2];
	testBuffer[5] = demoRingBuffer_test[4]; // #

	sprintf (Number,"%02d",demoRingBuffer_test[5]);
	testBuffer[6] = Number[0];
	testBuffer[7] = Number[1];

	testBuffer[8] = demoRingBuffer_test[6]; // #
	testBuffer[9] = 0;					    // Spazio

