gianluca996/LPC55S69/USB_Log_Insert/sources/host_msd_fatfs.c
	testBuffer[10] = demoRingBuffer_test[8]; // #

	sprintf (Number,"%02d",demoRingBuffer_test[9]);
	testBuffer[11] = Number[0];
	testBuffer[12] = Number[1];

	testBuffer[13] = demoRingBuffer_test[10]; // #
	testBuffer[14] = 0;					      // Spazio

	x = 15;
	for (i = 12; i <= 37; ++i)
	{
		testBuffer[x] = demoRingBuffer_test[i];
		x++;
	}


	testBuffer[41] = 0;

	x = 42;
	for (i = 0; i <= 244; ++i)
	{
		testBuffer[x] = test[i];
		x++;
	}

	testBuffer[287] = 0;
	testBuffer[288] = 63;
	testBuffer[289] = 63;
	testBuffer[290] = 10;

	 /*-------------------------------------------------------------------------------------------------------------------------------------------------------------*/


    fatfsCode = f_write(&file, testBuffer, 303, (UINT *)&resultSize);
    if ((fatfsCode) || (resultSize != 303))
    {
        usb_echo("error\r\n");
        f_close(&file);
        USB_HostMsdFatfsTestDone();
        return;
    }

    fatfsCode = f_sync(&file);
    if (fatfsCode)
    {
        usb_echo("error\r\n");
        f_close(&file);
        USB_HostMsdFatfsTestDone();
        return;
    }
    usb_echo("success\r\n");

//	EnableIRQ(DEMO_UART_IRQn);				//test Gianluca
//	GPIO_PinWrite(GPIOB, 18U, 0);			//test Gianluca

    /*-------------------------------------------------------------------------------------------------------------------------------------------------------------*/
 /*
    usb_echo("test f_printf......");
    if (f_printf(&file, _T("%s\r\n"), "f_printf test") == EOF)
    {
        usb_echo("error\r\n");
        f_close(&file);
        USB_HostMsdFatfsTestDone();
        return;
    }
    fatfsCode = f_sync(&file);
    if (fatfsCode)
    {
        usb_echo("error\r\n");
        f_close(&file);
        USB_HostMsdFatfsTestDone();
        return;
    }
    usb_echo("success\r\n");
*/
    /*-------------------------------------------------------------------------------------------------------------------------------------------------------------*/

    USB_HostMsdFatfsTestDone();

//  EnableIRQ(DEMO_UART_IRQn);		//test gianluca
//  GPIO_PinWrite(GPIOB, 18U, 0);	//test gianluca

    msdFatfsInstance->runState = kRunIdle;




}


#endif /* MSD_FATFS_THROUGHPUT_TEST_ENABLE */

void USB_HostMsdTask(void *arg, uint8_t Dati[])
{
    usb_status_t status;
    usb_host_msd_fatfs_instance_t *msdFatfsInstance = (usb_host_msd_fatfs_instance_t *)arg;

    if (msdFatfsInstance->deviceState != msdFatfsInstance->prevDeviceState)
    {
        msdFatfsInstance->prevDeviceState = msdFatfsInstance->deviceState;
        switch (msdFatfsInstance->deviceState)
        {
            case kStatus_DEV_Idle:
                break;

            case kStatus_DEV_Attached: /* deivce is attached and numeration is done */

                status = USB_HostMsdInit(msdFatfsInstance->deviceHandle,  &msdFatfsInstance->classHandle); /* msd class initialization */
                g_UsbFatfsClassHandle = msdFatfsInstance->classHandle;
                if (status != kStatus_USB_Success)
                {
                    usb_echo("usb host msd init fail\r\n");
                    return;
                }
                msdFatfsInstance->runState = kRunSetInterface;
                break;

            case kStatus_DEV_Detached: /* device is detached */

                msdFatfsInstance->deviceState = kStatus_DEV_Idle;
                msdFatfsInstance->runState = kRunIdle;
                USB_HostMsdDeinit(msdFatfsInstance->deviceHandle, msdFatfsInstance->classHandle); /* msd class de-initialization */
                msdFatfsInstance->classHandle = NULL;

                usb_echo("mass storage device detached\r\n");

                break;

            default:
                break;
        }
    }

    /* run state */
    switch (msdFatfsInstance->runState)
    {
        case kRunIdle:
            break;

        case kRunSetInterface: /* set msd interface */

            msdFatfsInstance->runState = kRunIdle;
            msdFatfsInstance->runWaitState = kRunWaitSetInterface;
            status = USB_HostMsdSetInterface(msdFatfsInstance->classHandle, msdFatfsInstance->interfaceHandle, 0, USB_HostMsdControlCallback, msdFatfsInstance);
            if (status != kStatus_USB_Success)
            {
                usb_echo("set interface fail\r\n");
            }
            break;

        case kRunMassStorageTest: /* set interface succeed */

			#if ((defined MSD_FATFS_THROUGHPUT_TEST_ENABLE) && (MSD_FATFS_THROUGHPUT_TEST_ENABLE))

						USB_HostMsdFatfsThroughputTest(msdFatfsInstance); 		/* test throughput */
			#else
						USB_HostMsdFatfsTest(msdFatfsInstance, Dati); 			/* test msd device */

			#endif /* MSD_FATFS_THROUGHPUT_TEST_ENABLE */

//				msdFatfsInstance->runState = kRunIdle;

            break;

        default:
            break;
    }
}

usb_status_t USB_HostMsdEvent(usb_device_handle deviceHandle,
                              usb_host_configuration_handle configurationHandle,
                              uint32_t eventCode)
{
    usb_status_t status = kStatus_USB_Success;
    usb_host_configuration_t *configuration;
    uint8_t interfaceIndex;
    usb_host_interface_t *interface;
    uint32_t infoValue;
    uint8_t id;

    switch (eventCode)
    {
        case kUSB_HostEventAttach:
            /* judge whether is configurationHandle supported */
            configuration = (usb_host_configuration_t *)configurationHandle;
            for (interfaceIndex = 0; interfaceIndex < configuration->interfaceCount; ++interfaceIndex)
            {
                interface = &configuration->interfaceList[interfaceIndex];
                id = interface->interfaceDesc->bInterfaceClass;
                if (id != USB_HOST_MSD_CLASS_CODE)
                {
                    continue;
                }
                id = interface->interfaceDesc->bInterfaceSubClass;
                if ((id != USB_HOST_MSD_SUBCLASS_CODE_UFI) && (id != USB_HOST_MSD_SUBCLASS_CODE_SCSI))
                {
                    continue;
                }
                id = interface->interfaceDesc->bInterfaceProtocol;
                if (id != USB_HOST_MSD_PROTOCOL_BULK)
                {
                    continue;
                }
                else
                {
                    if (g_MsdFatfsInstance.deviceState == kStatus_DEV_Idle)
                    {
                        /* the interface is supported by the application */
                        g_MsdFatfsInstance.deviceHandle = deviceHandle;
                        g_MsdFatfsInstance.interfaceHandle = interface;
                        g_MsdFatfsInstance.configHandle = configurationHandle;
                        return kStatus_USB_Success;
                    }
                    else
                    {
                        continue;
                    }
                }
            }
            status = kStatus_USB_NotSupported;
            break;

        case kUSB_HostEventNotSupported:
            break;

        case kUSB_HostEventEnumerationDone:
            if (g_MsdFatfsInstance.configHandle == configurationHandle)
            {
                if ((g_MsdFatfsInstance.deviceHandle != NULL) && (g_MsdFatfsInstance.interfaceHandle != NULL))
                {
                    /* the device enumeration is done */
                    if (g_MsdFatfsInstance.deviceState == kStatus_DEV_Idle)
                    {
                        g_MsdFatfsInstance.deviceState = kStatus_DEV_Attached;

                        USB_HostHelperGetPeripheralInformation(deviceHandle, kUSB_HostGetDevicePID, &infoValue);
                        usb_echo("mass storage device attached:pid=0x%x", infoValue);
                        USB_HostHelperGetPeripheralInformation(deviceHandle, kUSB_HostGetDeviceVID, &infoValue);
                        usb_echo("vid=0x%x ", infoValue);
                        USB_HostHelperGetPeripheralInformation(deviceHandle, kUSB_HostGetDeviceAddress, &infoValue);
                        usb_echo("address=%d\r\n", infoValue);
                    }
                    else
                    {
                        usb_echo("not idle msd instance\r\n");
                        status = kStatus_USB_Error;
                    }
                }
            }
            break;

